Revit 2026 API

# PointLoadCreate(Document, ElementId, AnalyticalElementSelector, XYZ, XYZ, PointLoadType) Method

---

Creates a new hosted point load within the project.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static PointLoad Create(
	Document document,
	ElementId hostElemId,
	AnalyticalElementSelector selector,
	XYZ forceVector,
	XYZ momentVector,
	PointLoadType symbol
)
```
```vb
Public Shared Function Create (
	document As Document,
	hostElemId As ElementId,
	selector As AnalyticalElementSelector,
	forceVector As XYZ,
	momentVector As XYZ,
	symbol As PointLoadType
) As PointLoad
```
```cpp
public:
static PointLoad^ Create(
	Document^ document,
	ElementId^ hostElemId,
	AnalyticalElementSelector selector,
	XYZ^ forceVector,
	XYZ^ momentVector,
	PointLoadType^ symbol
)
```
```fsharp
static member Create :
        document : Document *
        hostElemId : ElementId *
        selector : AnalyticalElementSelector *
        forceVector : XYZ *
        momentVector : XYZ *
        symbol : PointLoadType -> PointLoad
```

#### Parameters

document Document
     Document to which new point load will be added.
hostElemId ElementId
     The AnalyticalMember host element for the point Load.
selector AnalyticalElementSelector
     The start or end point of the Analytical Member element.
forceVector XYZ
     The applied 3d force vector.
momentVector XYZ
     The applied 3d moment vector.
symbol PointLoadType
     The symbol of the PointLoad. Set  to use default type.

#### Return Value

PointLoad If successful, returns the newly created PointLoad,  otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentException | The element hostElemId does not exist in the document -or- hostElemId is not permitted for this type of load. |
| ArgumentNullException | A non-optional argument was null |
| ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |
| ArgumentsInconsistentException | Thrown when force and moment vectors are equal zero. |
| InvalidOperationException | Thrown if type could not be set for newly created point load. |

#### Reference

PointLoad Class

Create Overload

Autodesk.Revit.DB.Structure Namespace